<?php
echo "ชื่อ-นามสกุล คือ $name <br>";
if ($sex == "1") {
	echo "เพศชาย <br>";
} else {
	echo "เพศหญิง <br>";
}

switch ($education) {
	case "1" :
		echo "ระดับการศึกษาสูงสุด คือ ต่ำกว่าปริญญาตรี <br>";
		break;
	case "2" :
		echo "ระดับการศึกษาสูงสุด คือ ปริญญาตรี <br>";
		break;
	case "3" :
		echo "ระดับการศึกษาสูงสุด คือ ปริญญาโท <br>";
		break;
	case "4" :
		echo "ระดับการศึกษาสูงสุด คือ ปริญญาเอก <br>";
		break;
}

if (($source1 == "1") && ($source2 == "2") && ($source3 == "3")) {
	echo "ข้าพเจ้าทราบเว็บไซต์นี้มาจาก เพื่อน และ การค้นหาจาก Search Engine และ โฆษณาทางทีวี/วิทยุ <br>";
} elseif (($source1 == "1") && ($source2 == "2")) {
	echo "ข้าพเจ้าทราบเว็บไซต์นี้มาจาก เพื่อน และ การค้นหาจาก Search Engine <br>";
} elseif (($source1 == "1") && ($source3 == "3")) {
	echo "ข้าพเจ้าทราบเว็บไซต์นี้มาจาก เพื่อน และ โฆษณาทางทีวี/วิทยุ <br>";
} elseif ($source1 == "1") {
	echo "ข้าพเจ้าทราบเว็บไซต์นี้มาจาก เพื่อน <br>";
} elseif (($source2 == "2") && ($source3 == "3")) {
	echo "ข้าพเจ้าทราบเว็บไซต์นี้มาจาก  การค้นหาจาก Search Engine และ โฆษณาทางทีวี/วิทยุ <br>";
} elseif ($source2 == "2") {
	echo "ข้าพเจ้าทราบเว็บไซต์นี้มาจาก  การค้นหาจาก Search Engine <br>";
} elseif ($source3 == "3") {
	echo "ข้าพเจ้าทราบเว็บไซต์นี้มาจาก  โฆษณาทางทีวี/วิทยุ <br>";
} else {
	echo "ข้าพเจ้าทราบเว็บไซต์นี้มาจาก  (ท่านไม่ได้เลือกตัวเลือกนี้) <br>";
}
echo "คำแนะนำสำหรับเว็บไซต์ คือ $comment";