<?  
//กำหนด Header ส่วนที่เกี่ยวข้อง  
define('FPDF_FONTPATH','font/');  // กำหนดพาธที่เก็บ font
require ('fpdf.php');		// เรียกใช้ไฟล์ fpdf.php
$pdf=new FPDF();		// สร้าง object ชื่อ pdf จากคลาส FPDF
$pdf->AddFont('regular','','angsana.php');	// เพิ่ม Font angsana ในรูปแบบปกติสำหรับใช้งาน
$pdf->AddFont('bold','B','angsanab.php');  	// เพิ่ม Font angsanab ในรูปแบบตัวหนาสำหรับใช้งาน
$pdf->AddFont('italic','I','angsanai.php');  	// เพิ่ม Font angsanai ในรูปแบบตัวเอียงสำหรับใช้งาน
$pdf->AddPage();  	// การสร้างไฟล์เอกสาร PDF
$pdf->Line(5,8,200,8);  // วาดเส้นตรงที่พิกัดเริ่มต้น (5,8) และสิ้นสุด (200,8) 
//พิมพ์ข้อความ  
$pdf->SetFont('regular','',16); 	// ใช้ Font angsana แบบปกติ ขนาด 16
$pdf->Text(25,20,'ตัวหนังสือปกติ ที่ตำแหน่งพิกัด 25,20'); // แสดงข้อความที่พิกัด 25,20
$pdf->SetFont('bold','B',16); 	// ใช้ Font angsanab แบบตัวหนา ขนาด 16
$pdf->Text(25,40,'ตัวหนังสือหนา ที่ตำแหน่งพิกัด 25,40'); // แสดงข้อความที่พิกัด 25,40
$pdf->SetFont('italic','I',16);	// ใช้ Font angsanai แบบตัวเอียง ขนาด 16
$pdf->Text(25,60,'ตัวหนังสือเอียง ที่ตำแหน่งพิกัด 25,60'); // แสดงข้อความที่พิกัด 25,60
$pdf->Line(5,80,200,80);  // วาดเส้นตรงที่พิกัดเริ่มต้น (5,80) และสิ้นสุด (200,80)
//สิ้นสุดการประมวลผลและส่งออกไฟล์เป็น PDF ไฟล์  
$pdf->Output();  
?>   
